IRP/src/Catalogs/ChequeBonds/ChequeBonds.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ChequeBonds</name>
  <attributes>
    <name>Type</name>
    <type>
      <types>EnumRef.ChequeBondTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>DueDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>Amount</name>
    <type>
      <types>DefinedType.typeAmount</types>
    </type>
  </attributes>
  <attributes>
    <name>ChequeSerialNo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>AddAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AddAttributeAndProperty</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

IRP/src/Enums/ChequeBondTypes/ChequeBondTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ChequeBondTypes</name>
  <enumValues>
    <name>OwnCheque</name>
  </enumValues>
  <enumValues>
    <name>PartnerCheque</name>
  </enumValues>
  <enumValues>
    <name>OwnObligation</name>
  </enumValues>
  <enumValues>
    <name>PartnerObligation</name>
  </enumValues>
</mdclass:Enum>

IRP/src/Catalogs/ChequeBonds/Forms/PickUpForm/Module.bsl
#Region FormEvents

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	ChequeBondType = PredefinedValue("Enum.ChequeBondTypes.OwnCheque");
EndProcedure

&AtClient
Procedure OnOpen(Cancel)
	// filter by status
	NewFilter = List.Filter.Items.Add(Type("DataCompositionFilterItem"));
	NewFilter.LeftValue = New DataCompositionField("Status");
	NewFilter.ComparisonType = DataCompositionComparisonType.InList;
	NewFilter.RightValue = StatusSelection;
	NewFilter.Use = False;
	ThisObject.FilterByStatusIndex = List.Filter.Items.IndexOf(NewFilter);

	// filter by type
	NewFilter = List.Filter.Items.Add(Type("DataCompositionFilterItem"));
	NewFilter.LeftValue = New DataCompositionField("Type");
	NewFilter.ComparisonType = DataCompositionComparisonType.Equal;
	NewFilter.RightValue = ChequeBondType;
	NewFilter.Use = True;
	ThisObject.FilterByChequeBondType = List.Filter.Items.IndexOf(NewFilter);
EndProcedure

#EndRegion

#Region FormItemsEvents

&AtClient
Procedure ListSelection(Item, RowSelected, Field, StandardProcessing)
	StandardProcessing = False;
	CurrentRow = Items.List.CurrentData;
	If CurrentRow = Undefined Then
		Return;
	EndIf;
	NewRow = PickedCheckBonds.Add();
	FillPropertyValues(NewRow, CurrentRow);
EndProcedure

&AtClient
Procedure ChequeBondTypeOnChange(Item)
	ThisObject.StatusCheck = False;
	ThisObject.StatusSelection = PredefinedValue("Catalog.ObjectStatuses.EmptyRef");
	SetFilterByStatus();
EndProcedure

&AtClient
Procedure StatusCheckOnChange(Item)
	SetFilterByStatus();
EndProcedure

&AtClient
Procedure StatusSelectionOnChange(Item)
	ThisObject.StatusCheck = ValueIsFilled(ThisObject.StatusSelection);
	SetFilterByStatus();
EndProcedure

&AtClient
Procedure SetFilterByStatus()
	If ThisObject.List.Filter.Items.Count() = 0 Then
		Return;
	EndIf;

	Filter = ThisObject.List.Filter.Items[ThisObject.FilterByStatusIndex];
	Filter.RightValue 	= ThisObject.StatusSelection;
	Filter.Use 			= ThisObject.StatusCheck;

	Filter = ThisObject.List.Filter.Items[ThisObject.FilterByChequeBondType];
	Filter.RightValue 	= ThisObject.ChequeBondType;
EndProcedure

#EndRegion

#Region CommandsEvents

&AtClient
Procedure CommandSaveAndClose(Command)
	Close(ThisObject.PickedCheckBonds);
EndProcedure

&AtClient
Procedure StatusSelectionStartChoice(Item, ChoiceData, StandardProcessing)
	DocChequeBondTransactionClient.StatusStartChoice(ThisObject.Source, ThisObject, Item, ChoiceData, StandardProcessing);
EndProcedure

&AtClient
Procedure StatusSelectionEditTextChange(Item, Text, StandardProcessing)
	DocChequeBondTransactionClient.StatusEditTextChange(ThisObject.Source, ThisObject, Item, Text, StandardProcessing);
EndProcedure

#EndRegion
